Revit 2026 API

# TabbedDialogExtension Properties

---

The TabbedDialogExtension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Control | The control. |
|  | OnCancelAction | The cancel handler. |
|  | OnOKAction | The ok handler. |
|  | OnRestoreDefaultsAction | The restore defaults handler. |

#### Reference

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace